// HindiUnicode.js
const arrayOne = [

    "aa", "a",
    "ZZ", "Z",
    "=kk", "=k",
    "f=k", "f=",
    
    "Q+Z", "QZ+",
    "sas", "sa",
    
    "‘", "\"",
    "’", "\"",
    "“", "'",
    "”", "'",
    
    "ƒ", "१",
    "„", "२",
    "…", "३",
    "†", "४",
    "‡", "५",
    "ˆ", "६",
    "‰", "७",
    "Š", "८",
    "‹", "९",
    "Œ", "०",
    "å", "०",
    
    "v‚", "ऑ",
    "vks", "ओ",
    "vkS", "औ",
    "vk", "आ",
    "v", "अ",
    "b±", "ईं",
    "Ã", "ई",
    "bZ", "ई",
    "b", "इ",
    "m", "उ",
    "Å", "ऊ",
    ",s", "ऐ",
    ",", "ए",
    "_", "ऋ",
    
    
    "d+", "क़",
    "[+", "ख़्",
    "x+", "ग़",
    "T+", "ज़्",
    "t+", "ज़",
    "M+", "ड़",
    "<+", "ढ़",
    "¶+", "फ़्",
    "Q+", "फ़",
    ";+", "य़",
    "j+", "ऱ",
    "u+", "ऩ",
    
    "d", "क",
    "D", "क्",
    "£", "ख्र",
    "[", "ख्",
    "x", "ग",
    "X", "ग्",
    "Ä", "घ",
    "?", "घ्",
    "³", "ङ",
    "p", "च",
    "P", "च्",
    "N", "छ",
    "t", "ज",
    "T", "ज्",
    ">", "झ",
    "÷", "झ्",
    "Ö", "झ्",
    "¥", "ञ",
    "V", "ट",
    "B", "ठ",
    "M", "ड",
    "<", "ढ",
    ".", "ण्",
    "r", "त",
    "R", "त्",
    "F", "थ्",
    "n", "द",
    "/", "ध्",
    "Ë", "ध्",
    "è", "ध्",
    "u", "न",
    "U", "न्",
    "i", "प",
    "I", "प्",
    "Q", "फ",
    "¶", "फ्",
    "c", "ब",
    "C", "ब्",
    "Ò", "भ",
    "H", "भ्",
    "e", "म",
    "E", "म्",
    ";", "य",
    "¸", "य्",
    "j", "र",
    "y", "ल",
    "Y", "ल्",
    "G", "ळ",
    "Üo", "श्व",
    "Ük", "श", // as used in 'shringaal' etc
    "Üz", "श्र्",
    "o", "व",
    "O", "व्",
    
    "'", "श्",
    "\"", "ष्",
    "l", "स",
    "L", "स्",
    "g", "ह",
    
    "Ñ", "कृ",
    "—", "कृ",
    "ô", "क्क",
    "ä", "क्त",
    "{", "क्ष्",
    "K", "ज्ञ",
    
    "ê", "ट्ट",
    "Í", "ट्ट",
    "ë", "ट्ठ",
    "Î", "ट्ठ",
    "ð", "ठ्ठ",
    "Ï", "ड्ड",
    "ì", "ड्ड",
    "ï", "ड्ढ",
    "Ô", "ड्ढ",
    
    "Ù", "त्त्",
    "=", "त्र",
    "«", "त्र्",
    "–", "दृ",
    "Ì", "द्द",
    "í", "द्द",
    "\)", "द्ध",
    "˜", "द्भ",
    "ö", "द्भ",
    "|", "द्य",
    "}", "द्व",
    "é", "न्न",
    "™", "न्न्",
    
    "ó", "स्त्र",
    "â", "हृ",
    "à", "ह्न",
    "ã", "ह्म",
    "á", "ह्य",
    "º", "ह्",
    
    "J", "श्र",
    "Ø", "क्र",
    "Ý", "फ्र",
    "æ", "द्र",
    "ç", "प्र",
    "Á", "प्र",
    "#", "रु",
    ":", "रू",
    
    "Ó", "्य",
    "î", "्य",
    "z", "्र",
    "ª", "्र",
    
    // "Ç" ,	"िं", 
    "È", "ीं",
    "Ê", "Zी",
    "\›", "Zैं",
    "õ", "Zैं",
    "±", "Zं",
    "Æ", "र्f",
    "É", "र्Ç",
    
    "्k", "",
    
    "‚", "ॉ",
    "¨", "ो",
    "®", "ो",
    "ks", "ो",
    "©", "ौ",
    "kS", "ौ",
    "h", "ी",
    "q", "ु",
    "w", "ू",
    "`", "ृ",
    "s", "े",
    "¢", "े", //suitable for ka
    "S", "ै",
    "a", "ं",
    "¡", "ँ",
    "%", "ः",
    "W", "ॅ",
    "•", "ऽ",
    "·", "ऽ",
    "∙", "ऽ",
    "·", "ऽ",
    "~", "्",
    "+", "़",
    "k", "ा",
    
    "A", "।",
    "ñ", "॰",  // laaghava
    
    "\\", "?",
    " ः", " :",
    "^", "‘",
    "*", "’",
    "Þ", "“",
    "ß", "”",
    "(", ";",
    "¼", "(",
    "½", ")",
    "¿", "{",
    "À", "}",
    "¾", "=",
    "-", ".", // full stop?
    "&", "-",
    //"&" ,	"µ" ,
    "]", ",",
    "@", "/",
    
    "~ ", "् ",
    "ाे", "ो",
    "ाॅ", "ॉ",
    "े्र", "्रे",
    "अौ", "औ",
    "अो", "ओ",
    "आॅ", "ऑ"]


    // export const convertToUnicode = (text) => {
    //     // Implement your conversion logic here
    //     let convertedText = text;
    
    //     for (let i = 0; i < arrayOne.length; i += 2) {
    //         const re = new RegExp(arrayOne[i], 'g');
    //         convertedText = convertedText.replace(re, arrayOne[i + 1]);
    //     }
    
    //     return convertedText;
    // };


    export function convertToUnicode(text) {
        console.log("🚀 ~ convertToUnicode ~ text:", text);
        let convertedText = text;
      
        for (let i = 0; i < arrayOne.length; i += 2) {
            const re = new RegExp(arrayOne[i], 'g');
            convertedText = convertedText.replace(re, arrayOne[i + 1]);
        }
      
        return convertedText;
    }